app/Controllers/User.php

    public function index(){
      $model = new UserModel();
      $data['employees'] = $model->orderBy('user_id', 'DESC')->findAll();
---
SELECT *
FROM `idm_users`
ORDER BY `user_id` DESC

    public function userLogin(){
        $userModel = new UserModel();
        $email = $this->request->getVar('email');
        $pass = base64_decode($this->request->getVar('password'));
        $password = md5($pass);
        $data = $userModel->where('email', $email)->first();
---
SELECT *
FROM `idm_users`
WHERE `email` = 'rohit@gmail.com'
 LIMIT 1